var mockdata = [
	{
		objectId: 982342342352,
		username: "testrock",
  		create_at: 132434,
  		finalmodified_at: 234234,
		title: "왜 진보주의자는 버니 샌더스를 닮을 수 없을까?",
		tag: [],
		content: "다행히 법원의 행정명령 때문에 제동이 걸렸지만 도널드 트럼프의 ‘정신 나간’ 반이민법은 앞으로 도널드 트럼프가 대통령을 하는 미국의 미래에 대한 암울한 전망을 더욱 어둡게 만들고 있다. 반이민법은 이민으로 건국된 미국의 정체성과 반대되는 것이기도 하지만, 동시에 반인권적이며 특정 국적과 인종 그리고 종교에 대한 편견에 기울어진 조치이기도 하다. 이러한 반이민법에 제동이 걸린 것은 많은 시민과 사회단체들이 반대 목소리를 낸 덕분이지만 미국의 진보와 리버럴이 대중의 지지를 얻지 않는다면 앞으로 트럼프는 단념하지 않을 것이다. 미국 내에서는 여전히 반이민법에 대한 지지여론이 강하기 때문이다. 일부 여론조사에서는 반이민법에 대한 지지율이 절반(55%)을 넘은 바 있다.",
	},
	{
		objectId: 12235123512351,
		username: "testrock",
  		create_at: 12312434,
  		finalmodified_at: 234234234,
		title: "한계를 극복한 단순한 데이터 모델",
		tag: [],
		content: "앞서 말했듯이 Flux에서의 뷰는 MVC의 뷰와는 달리 화면을 표시하는 것은 물론 컨트롤러의 성격도 가지고 있다. 특히 중첩된 뷰 레이어의 최상위 뷰는 스토어에서 데이터를 가져와 이를 자식 뷰로 배분하는 역할을 하고 있기 때문에 컨트롤러-뷰(controller-view)라고도 부른다. 컨트롤러-뷰가 있다는 것은 달리 말하면 곧 자식 뷰에서는 직접 데이터를 가져오는 대신 props 형태로 상위 뷰에서 전달받는 방식을 주로 사용한다는 의미도 된다. 물론 필요에 따라 하위 뷰에서도 직접 스토어의 데이터를 가져오기도 한다.뷰는 관련 스토어의 변경 사항을 감지할 수 있는 이벤트 리스너를 스토어에 등록하고, 스토어에 변경 사항이 발생하면 이를 뷰에 반영한다. 이 때 뷰에서는 자신의 setState()나 forceUpdate() 메소드를 실행하고, 이로 인해 자동적으로 render() 메소드도 호출된다. 다음은 페이스북의 Todo 예제에서 가져온 React 컴포넌트의 일부 코드이다. 이를 통해 React로 작성된 뷰와 스토어가 어떻게 동작하는지 짐작해 볼 수 있다.",
	},
	{
		objectId: 123346456,
		username: "testrock",
  		create_at: 122234,
  		finalmodified_at: 234234,
		title: "터키, '박정희' 대신 '누르시'를 선택하다",
		tag: [],
		content: "그 중에서도 베이오울루에 터를 잡은 것은 순전히 오르한 파묵 때문이었다. 학창 시절 그의 작품에 흠뻑 빠졌다. 움베르토 에코의 <장미의 이름>(이윤기 옮김, 열린책들 펴냄)보다 <내 이름은 빨강>(이난아 옮김, 민음사 펴냄)을 더 높이 쳤다. 부러 파묵이 사는 동네에 집을 구한 것이다. 그의 소설 제목을 따서 만든 '순수의 박물관(Masumiyet Müzesi)'까지 5분 남짓 거리였다. 파묵은 '이스탄불의 작가'라고도 할 수 있는 인물이다. <이스탄불>이라는 회고집도 발간했을 뿐더러, 거개의 작품이 이스탄불을 배경으로 하고 있다. 토박이라고 여겼다.",
	},
	{
		objectId: 725554,
		username: "testrock",
  		create_at: 45645,
  		finalmodified_at: 254555,
		title: "조지 소로스 위기에 처한 열린 사회…EU, 1990년 소련처럼 붕괴할 수 있다",
		tag: [],
		content: "나는 여든여섯 살 먹은 헝가리 출신 유대인으로 2차 세계대전이 끝난 뒤 미국 시민이 됐다. 어떤 정치체제가 지배하는가의 중요성을 어릴 때 배웠다. 히틀러의 독일이 1944년 헝가리를 점령했을 때 아버지는 상황이 심각한 것을 깨닫고 가족과 주변의 여러 유대인을 위해 가짜 신분증을 구해왔다. 그렇지 않았다면 나는 아마 그때 죽었을 것이다. 그의 도움으로 대부분 살아남았다.",
	},
	{
		objectId: 7173266,
		username: "testrock",
  		create_at: 234231,
  		finalmodified_at: 234235,
		title: "신장섭 싱가포르국립대 교수에게",
		tag: [],
		content: "수긍할 만한 그의 주장은 많다. 2008년 리먼 브러더스 사태 때 미국이 취한 극단의 저금리를 포함한 양적완화 정책은 국제통화기금 사태 때 한국에 강요했던 고금리 정책과는 반대였다는 것, 주주행동주의가 미국에서 낳은 과도한 배당 등 약탈적 특성이 그렇다. 그럼에도 그의 논리 전체를 관통하는 핵심, 곧 논리적으로는 1970년대 미국에서 나타난 전문경영진의 전횡과 한국 재벌체제의 문제점은 동일하다는 시각, 실천적으론 주주행동주의를 본질로 하는 경제민주화는 정책의 영역에서 추방돼야 한다의 시각에는 동의하기 매우 어렵다. 미국에서 연역해 경제민주화를 주주행동주의와 등치시키는 것은 경제민주화를 복지 강화 정도로 보는 것만큼이나 잘못된 것이다.",
	},
	{
		objectId: 87234234,
		username: "testrock",
  		create_at: 1252134234,
  		finalmodified_at: 9879879,
		title: "오펙 감산 합의 따라 유가 급등…장기 오름폭은 작을 듯",
		tag: [],
		content: "이번 오펙의 합의에 대해 전문가들은 단기적으로 유가가 오르겠지만, 중장기적으로 오름폭은 작을 것으로 내다봤다. 이달석 에너지경제연구원 선임연구위원은 “저유가 상태에서 증산을 계속해온 오펙 국가들이 생산량 관리로 돌아선 것은 의미가 있다. 그러나 합의한 120만배럴 감산이 실제 이뤄질지는 의문”이라고 밝혔다. 이 위원은 “브렌트유 기준으로 내년 평균 유가는 올해 평균 유가보다 10달러 정도 높은 배럴당 55달러 전후가 될 것”이라고 내다봤다.",
	},
	{
		objectId: 982345,
		username: "testrock",
  		create_at: 87987987,
  		finalmodified_at: 9809809,
		title: "[단독] 청와대서 국민연금에 삼성물산 합병 찬성 종용했다 ",
		tag: [],
		content: "국민연금의 태도를 둘러싼 의혹은 최근 ‘최순실 게이트’로 다시 불거졌다. 참여연대 등 시민단체들은 국민연금이 불공정한 비율로 이뤄진 합병에 찬성해 6천억원의 손실을 떠안았다며 홍완선 전 국민연금 기금운용본부장을 배임 혐의로 고발한 바 있다. 최씨가 사실상 설계한 미르재단과 케이(K)스포츠재단에 삼성이 거액을 출연한 것에 이어 최씨 개인회사에 280만유로(약 35억원)를 송금한 사실도 드러나면서, 삼성과 최씨 쪽의 ‘커넥션’이 주목받는 것이다. 합병안 가결 일주일 뒤에 이재용 부회장은 청와대에서 박 대통령을 독대했고, 다음달에는 삼성전자가 최씨 회사인 독일 비덱스포츠에 송금을 시작했다. 검찰은 당시 박 대통령을 독대한 재벌 총수 7명이 ‘민원’을 제출한 대가로 미르재단 등에 대한 지원에 나섰을 가능성을 집중 조사하고 있다. 앞서 지난해 3월에는 박상진 삼성전자 사장이 대한승마협회장이 돼 최씨 딸 정유라씨 지원을 위한 포석이라는 의심을 사고 있다. 해당 전문위원은 “최근 사안(최순실 게이트)을 보면 돈을 받았으니까 정부가 그렇게 움직였을 것이라는 의심이 생긴다”고 말했다.",
	},
	{
		objectId: 875543,
		username: "testrock",
  		create_at: 98798622,
  		finalmodified_at: 456456456,
		title: "[KBS 공감토론] 박지원 12일 촛불집회 야당 대표들 모두 나갈 것",
		tag: [],
		content: "여러분 안녕하십니까. KBS <공감토론> 백운기입니다. 요즘 하루하루가 충격의 연속입니다. 최순실 쇼크에 이어서 이번에는 트럼프 쇼크입니다. 대통령의 헌법 파괴적 국정운영의 충격에서 아직도 헤어 나오지 못한 우리 대한민국은 이제는 트럼프라는 예측하기 힘든 미국 대통령이 펼쳐나갈 외교정책에 어떻게 대응해야 할지 큰 숙제를 안게 됐습니다. 대통령에 대한 지지가 땅에 떨어진 지금 내우외환에 빠진 대한민국을 이끌고 갈 새로운 인물이 빨리 나타나기를 소망하는 국민들의 목소리가 높아지고 있습니다. KBS <공감토론> 매주 수요일은 중진 정치인을 만나는 직격인터뷰로 꾸미고 있습니다. 오늘은 국민의당 박지원 비상대책위원장이 나오셨습니다. 국민 눈높이에서 속 시원한 말씀을 기대해 보겠습니다. 이슈다운 이슈! 토론다운 토론! KBS <공감토론> 시작합니다!",
	},
	{
		objectId: 86743,
		username: "testrock",
  		create_at: 97523423,
  		finalmodified_at: 6868273234,
		title: "누가 멀쩡했던 중소 건설사를 파산하게 만들었나",
		tag: [],
		content: "이와 별개로 현대건설은 2013년 11월 이 공사를 시작한 이래 발주처인 쿠웨이트 정부 측 감리단으로부터 수차례에 걸쳐 '경고장'을 받았다. 부실공사와 그로 인한 공기(工期) 지연, 미승인도면 사용 등을 지적하는 내용이었다. '모든 결과는 오로지 현대건설의 책임' '용인될 수 없는 상황에 대한 시정 방안을 즉각 제출하라' 등의 표현이 담겼다. 현대건설의 올해 1분기 사업보고서를 보면, 이 현장에서 미(未)청구공사대금 1650억원이 발생한 것으로 나와 있다. 미청구공사대금은 공사 비용이 들어갔지만, 발주처에 청구하지 못한 금액을 가리킨다. 현대건설의 미청구공사대금 총액은 2조5048억원으로 국내 건설업체 중 가장 많다. 현대건설 측은 감리단으로부터 수차례 지적을 받은 것은 사실이나 해외 현장에서는 자주 있는 일이라며 미청구공사대금은 여러 가지 이유가 복합된 것이어서, 이번 사건 때문만이라 볼 수 없다고 했다.",
	},
	{
		objectId: 8073478,
		username: "testrock",
  		create_at: 976978623,
  		finalmodified_at: 2234234,
		title: "우병우가 다가오자 수사관들이 일어섰다",
		tag: [],
		content: "다섯 시간 동안 총 두 번 우병우의 모습을 기록했다. 밤 8시반에 자리를 잡고 난 직후인 8시 50분쯤 처음 카메라에 모습이 포착됐다. 처음에는 우병우만 보였다. 1분 여동안 조사실 안에서 왔다갔다 스트레칭도 하는 모습이 보였다. 벽에 얼굴이 가려 더 잘 보이는 장면을 찍기 위해 기다렸다. 잠시 후 9시25분께 우병우의 모습이 다시 1분 여 동안 포착됐다. 처음에는 오른쪽에 보이는 수사관들이 앉아 있었다. 그런데 우 전 수석이 가까이 오니까 수사관들이 일어섰다. 우병우가 말을 거니까 수사관들이 답을 하는 분위기처럼 보였다. 나중에 생각해보니 그 상황은 좀 어이없었다.",
	},
	{
		objectId: 63843755,
		username: "testrock",
  		create_at: 75765765234,
  		finalmodified_at: 8768234234,
		title: "교황 여성 사제는 영원히 허용될 수 없다",
		tag: [],
		content: `프란치스코 교황이 여성 사제(司祭)는 영원히 허용될 수 없다고 밝혔다. 여성이 사제가 될 수 없다는 견해는 그동안 밝혀왔지만 영속성을 강조한 것은 이번이 처음이다. 1일(현지시간) 뉴욕타임스 등에 따르면 스웨덴을 방문한 교황이 바티칸으로 돌아오는 전용기에서 여성은 사제가 될 수 없냐는 스웨덴 기자의 질문에 이같이 답했다. 교황은 "성 요한 바오로 2세가 이에 대해 분명히 말씀을 하셨으며, 이는 지금도 유효하다"고 밝혔다. 이어 기자가 "그러나 영원히 불가능한 것이냐"고 되묻자 교황은 "성 요한 바오로 2세의 선언문을 주의깊게 읽어보면 그러한 방향으로 가야 한다"고 답했다. 요한 바오로 2세의 선언문은 1994년에 발표된 것으로 '여성은 절대 사제가 될 수 없다'는 내용을 담고 있다. 이를 따르겠다는 것은 여성 사제의 가능성을 열어두지 않겠다는 의미다. 다만 교황은 "여성은 다른 것들을 남성보다 더 잘할 수 있다"며 "성모 마리아뿐만 아니라 여성들은 교회의 신학과 영성에 중요한 영향을 미쳤다"고 강조했다. 한편 지난 5월 프란치스코 교황이 가톨릭 내 성직자 3분류 중 하나인 부제(副祭)에 여성을 허용할 수 있다고 언급하면서 여성 사제도 등장할 수 있다는 전망이 제기돼왔다.`,
	},
	{
		objectId: 8544222,
		username: "testrock",
  		create_at: 86234234,
  		finalmodified_at: 897098709870,
		title: '[단독 인터뷰] 사우디 왕자 백달러 고유가 시대 다신 안온다',
		tag: [],
		content: `'인사이드 애플(Inside Apple)'이라는 책을 쓴 잡지 포천의 기자 아담 라쉰스키는 애플의 전, 현직 직원과 많은 대화를 나눴다. 그는 스탠포드에서 열린 '기업의 비밀 유지(Keeping Company Secrets)'라는 강연에서 애플의 기업 문화에 대해 많은 이야기를 털어놨다. 그는 "애플 직원은 곁눈가리개를 한 경주마를 닮았다. 왼쪽이나 오른쪽을 볼 수 없다. 에너지의 110%를 소진해 앞만 보고 달려야 한다"라고 말했다.`
	}
].sort((a, b)=>{
	if (a.finalmodified_at > b.finalmodified_at) {
		return -1
	}
	if (a.finalmodified_at < b.finalmodified_at) {
		return 1
	}
	if (a.finalmodified_at === b.finalmodified_at) {
		return 1
	}	

})

export default mockdata
	//_userId: { type: Schema.Types.ObjectId, ref: 'User', required: true},
	//username: String,
 // 	create_at: ,
 // 	finalmodified_at: Date,
	//type: { type: 'String', required: true},
	//title: { type: 'String', required: true },
	//tag: Object,
	//content: String,